from uuid import UUID
from datetime import datetime

from sqlalchemy.ext.asyncio import create_async_engine, async_sessionmaker

from bot.models import Employee, Product, Course, CourseSchedule
from bot.config import settings


async def add_objects(Session, objType, objs: list[dict]):
    async with Session() as db:
        for obj in objs:
            db.add(objType(**obj))

        await db.commit()


async def run():
    engine = create_async_engine(settings.DATABASE_URI, pool_size=20, max_overflow=20, future=True)

    session = async_sessionmaker(engine, expire_on_commit=False)

    employees = list()
    employees.append({'uid': UUID("278bba62-5521-daa7-fff7-002948575567"),
                      'data': {'firstName': 'Юрій', 'lastName': 'Сіроха'}})
    employees.append({'uid': UUID("271bba62-5521-daa7-aaf7-002948575567"),
                      'data': {'firstName': 'Віктор', 'lastName': 'Сасін'}})
    employees.append({'uid': UUID("931bab62-5521-baf7-daa7-002948596355"),
                      'data': {'firstName': 'Андрій', 'lastName': 'Лабич'}})
    employees.append({'uid': UUID("271bba62-5521-daa7-aaf7-002948576755"),
                      'data': {'firstName': 'Анастасія', 'lastName': 'Рибцова'}})
    employees.append({'uid': UUID("271bba62-5521-aaf7-daa7-002948576755"),
                      'data': {'firstName': 'Вікторія', 'lastName': 'Коверга'}})
    employees.append({'uid': UUID("271bba62-5521-aaf7-daa7-002948596355"),
                      'data': {'firstName': 'Костянтин', 'lastName': 'Єзик'}})
    employees.append({'uid': UUID("931bab62-5521-baf1-daa7-002948635955"),
                      'data': {'firstName': 'Андрій', 'lastName': 'Тимофєєв'}})
    employees.append({'uid': UUID("931bab62-5721-baf3-daa9-002948635955"),
                      'data': {'firstName': 'Марина', 'lastName': 'Башкатова'}})
    employees.append({'uid': UUID("931bab72-8721-baf8-daa9-002948635559"),
                      'data': {'firstName': 'Олексій', 'lastName': 'Кулівець'}})
    await add_objects(session, Employee, employees)

    products = list()
    products.append({'uid': UUID("121abb13-8271-abf1-ada2-002934865559"),
                     'data': {'name': 'Інструктор групових програм EQF-3',
                              'descriptions': 'Це базовий курс з підготовки фахівців фітнес індустрії, після якого випускники можуть працювати в любому спортивному або фітнес клубі, як тренер групових занять. Вивчається: базова, танцювальна та степ аеробіка; силовий та функціональний тренінг; стретчинг. Після навчання випускники зможуть самостійно побудувати та провести любий груповий клас за цими напрямками. Тривалість навчання півтора місяці.',
                              'content': '<b><u>Теоретичний блок:</u></b>\nАнатомія, фізіологія, біомеханіка руху;\nТеорія тренувального процесу;\nАдаптація до фізичного навантаження та методи зміни її інтенсивності;\nАеробіка та силові класи;\nОснови харчування;\n\n<b><u>Практичний блок:</u></b>\nСтруктура групового тренування та складання тренувальних програм;\nВивчення принципів ритміки та роботи під музику;\nБазові кроки та їх модифікації;\nЗміни ніг, складання та розкладки зв’язок;\nТренерські навички роботи із групою;\nНавички розподілу навантажень, контроль за технікою безпекою та здоров’ям клієнтів;\nФункціональний тренінг;',
                              'certificate': 'По завершенню навчання випускники отримують міжнародний сертифікат із присвоєнням кваліфікації «Group Fitness Instructor – EQF Level 3» та зараховуються до Єдиного Українського Тренерського Реєстру REPS Ukraine. Пластиковий сертифікат відправляємо Новою Поштою по Україні (для онлайн курсів)',
                              'order': 1
                              }
                     })

    products.append({'uid': UUID("122abb13-8271-abf1-ada2-002934865559"),
                     'data': {'name': 'Інструктор тренажерного залу EQF-3',
                              'descriptions': 'Це базовий курс з підготовки фахівців фітнес індустрії, після якого випускники можуть працювати в любому спортивному або фітнес клубі, як тренер тренажерної зали. Вивчається: робота з тренажерами, з вільними вагами та з власним тілом; техніка виконання вправ, дихання та координації рухів.\nПісля навчання випускники зможуть самостійно скласти тренувальну програму для будь якого клієнта та провести тренування. Тривалість навчання півтора місяці',
                              'content': '<b><u>Теоретичний блок:</u></b>\nАнатомія, фізіологія, біомеханіка руху;\nПринципи тренувального процесу;\nФізіологічні процеси, що відбуваються в організмі під час тренування;\nАдаптація та безпека фізичного навантаження;\nМетоди зміни інтенсивності навантажень;\nМодифікації вправ;\nАеробне/анаеробне навантаження;\nМетодики моніторингу інтенсивності вправ;\nМетодика побудування тренувального процесу, враховуючи тип клієнта та його цілі;\nОснови харчування.\n\n<b><u>Практичний блок:</u></b>\nЗнайомство з видами тренажерів, коректною роботою з ними та вільними вагами на практиці;\nВиди вправ різні групи м’язів, їх модифікації із застосуванням різного обладнання, техніка виконання;\nПланування та організація тренувального процесу;\nСкладання тренувальних програм залежно від стану здоров’я, статі, віку, цілей та завдань клієнта;\nВиди тренувань, цикли;',
                              'certificate': 'По завершенню навчання випускники отримують міжнародний сертифікат із присвоєнням кваліфікації «Gym Instructor – EQF Level 3» та зараховуються до Єдиного Українського Тренерського Реєстру REPS Ukraine. Пластиковий сертифікат відправляємо Новою Поштою по Україні (для онлайн курсів)',
                              'order': 2
                              }
                     })

    products.append({'uid': UUID("123abb13-8271-abf1-ada2-002934865559"),
                     'data': {'name': 'Персональний тренер EQF-4',
                              'descriptions': 'Це найвищій рівень з підготовки фахівців фітнес індустрії. До курсу допускаються тренери, які вже мають базову освіту за кваліфікацією «інструктор тренажерної зали». Під час навчання тренери отримають поглиблені знання з функціональної анатомії та кінезіології, біомеханіки руху, тестування фізичного стану клієнта, модифікації базових вправ під задачі кожного клієнта, методики тренування професійних спортсменів. Тривалість навчання півтора місяці.',
                              'content': '<b><u>Теоретичний блок:</u></b>\nФункціональна анатомія та біомеханіка руху;\nПринципи тренувального процесу;\nФізіологія, кінезіологія;\nАдаптація до фізичного навантаження, моніторинг його інтенсивності;\nМетоди зміни інтенсивності навантажень;\nМодифікації вправ;\nРозвиток сили, швидкості, витривалості, гнучкості та координації;\nМетодика побудування тренувального процесу, враховуючи тип клієнта та його цілі.\n\n<b><u>Практичний блок:</u></b>\nОцінка фізичного стану клієнта;\nСоматотипи;\nТехніка виконання вправ та їх модифікація;\nТренувальні адаптації;\nРозробка та планування тренувальних програм;\nПереодизація навантажень;\nРобота з професійними спортсменами;',
                              'certificate': 'По завершенню навчання випускники отримують міжнародний сертифікат із присвоєнням кваліфікації «Personal Trainer – EQF Level 4» та зараховуються до Єдиного Українського Тренерського Реєстру REPS Ukraine. Пластиковий сертифікат відправляємо Новою Поштою по Україні (для онлайн курсів)',
                              'order': 3
                              }
                     })

    products.append({'uid': UUID("124abb13-8271-abf1-ada2-002934865559"),
                     'data': {'name': 'Дієтолог-нутріціолог',
                              'descriptions': 'Авторський курс від лікаря загальної практики, дипломованого дієтолога – нутріціолога. Це повний базовий курс навчання, призначений для людей з різним рівнем досвіду та знань у цій галузі.Складається з 8 блоків лекцій та практичної цінної інформації, у яких максимально повно розкривається тема дієтології та даються глибокі знання. По закінченню навчання випускники отримують сертифікати, що підтверджують їх рівень освіти та кваліфікацію та можуть працювати дієтологами-нутриціологами у будь-якому спортивно-оздоровчому центрі або здійснювати персональну практику.',
                              'content': '<b><u>Блок 1.</u></b> Травнева система. Мікрофлора\n– травнева система, будова та функції;\n– ферменти та їх функції;\n– печінка: будова та функції;\n– тонкий та товстий кишечник: будова та функції;\n– цикл травлення; – мікрофлора.\n<b><u>Блок 2.</u></b> Обмін речовин. БЖВ: їх види та джерела\n– БЖВ: функції та види;\n– водний баланс.\n<b><u>Блок 3.</u></b> Мікронутрієнти. Вітаміни. Баластові речовини\n– джерела;\n– добові норми;\n– функції;\n<b><u>Блок 4.</u></b> Гормони, що впливають наголод, травлення та обмін речовин\n– інсулін;\n– кортизол;\n– грелін;\n– тестостерон;\n– естроген;\n– прогестерон;\n– тироксін;\n– трийодтіронін;\n– лептін;\n– мелатонін;\n– глюкокортикоїди.\n<b><u>Блок 5.</u></b> Голод та його види. Інтервальне голодування\n– кількісне/якісне голодування, причини голоду;\n– булімія та анорексія;\n– хвороби, що впливають на засвоєння нутрієнтів.\n<b><u>Блок 6.</u></b> Психологія харчової поведінки. Стрес. Мотивація.\n<b><u>Блок 7.</u></b> Розрахунок БЖВ\n– практична робота.\n<b><u>Блок 8.</u></b> Внутрішній іспит для підтвердження знань та сертифікація.',
                              'certificate': 'Пластиковий сертифікат відправляємо Новою Поштою по Україні.',
                              'order': 4
                              }
                     })

    await add_objects(session, Product, products)

    courses = list()
    # Інструктор групових програм EQF-3
    courses.append({'uid': UUID("221abb13-8271-abf1-ada2-002934865559"),
                    'data': {'productUid': UUID("121abb13-8271-abf1-ada2-002934865559"),
                             'name': 'Київ',
                             'employeeUids': [UUID("271bba62-5521-daa7-aaf7-002948575567"),
                                              UUID("271bba62-5521-daa7-aaf7-002948576755")],
                             'price': 8000,
                             'descriptions': '- заняття проходять по суботах та неділях по 4-5 годин на день в залежності від теми;\n- теоретичний матеріал вивчається в онлайн форматі. навчання відбувається з використанням навчальної платформи (в неї можна заходити з телефону, планшету чи комп’ютеру) та програми Zoom. Це лекції з анатомії та фізіології (4 шт);\n- заняття проходять в групі онлайн згідно за розкладом. Всі лекції записуються та відгружаються на навчальну платформу. Їх можна передивлятись в любий час за потребою;\n- додатково на платформі є лекції у запису з теоретичного матеріалу для самостійного вивчення;\n- студентам надаються методичні матеріали та професійна література;\n- у групи є куратор, який допомагає студентам в організаційних моментах навчання;\n- після проходження кожної теми, для закріплення матеріалу, треба виконувати домашні завдання (у вигляді тестів) і відправляти їх на перевірку;\n- після вивчення теорії починається практика;\n- практичні заняття відбуваються офлайн у фітнес клубі',
                             'exam': '<b>теорія:</b>\nтест. Питання з анатомії, фізіології, теорії тренувального процесу;\n<b>практика:</b>\nскласти та провести демо версію тренування (аеробна частина, силовий блок та стретчинг).',
                             'location': 'Клуб Sport Life Оскорки. Київ, Дніпрвовська набережна, 26Л',
                             'crmId': 'id_8',
                             'order': 1
                             }
                    })

    courses.append({'uid': UUID("222abb13-8271-abf1-ada2-002934865559"),
                    'data': {'productUid': UUID("121abb13-8271-abf1-ada2-002934865559"),
                             'name': 'Харків',
                             'employeeUids': [UUID("271bba62-5521-daa7-aaf7-002948575567"),
                                              UUID("271bba62-5521-aaf7-daa7-002948576755")],
                             'price': 7500,
                             'descriptions': '- заняття проходять по суботах та неділях по 4-5 годин на день в залежності від теми;\n- теоретичний матеріал вивчається в онлайн форматі. навчання відбувається з використанням навчальної платформи (в неї можна заходити з телефону, планшету чи комп’ютеру) та програми Zoom. Це лекції з анатомії та фізіології (4 шт);\n- заняття проходять в групі онлайн згідно за розкладом. Всі лекції записуються та відгружаються на навчальну платформу. Їх можна передивлятись в любий час за потребою;\n- додатково на платформі є лекції у запису з теоретичного матеріалу для самостійного вивчення;\n- студентам надаються методичні матеріали та професійна література;\n- у групи є куратор, який допомагає студентам в організаційних моментах навчання;\n- після проходження кожної теми, для закріплення матеріалу, треба виконувати домашні завдання (у вигляді тестів) і відправляти їх на перевірку;\n- після вивчення теорії починається практика;\n- практичні заняття відбуваються офлайн у фітнес клубі',
                             'exam': '<b>теорія:</b>\nтест. Питання з анатомії, фізіології, теорії тренувального процесу;\n<b>практика:</b>\nскласти та провести демо версію тренування (аеробна частина, силовий блок та стретчинг).',
                             'location': 'Клуб Puls Gym. Харків, вул. Космонавтів, 8',
                             'crmId': 'id_9',
                             'order': 2
                             }
                    })

    courses.append({'uid': UUID("223abb13-8271-abf1-ada2-002934865559"),
                    'data': {'productUid': UUID("121abb13-8271-abf1-ada2-002934865559"),
                             'name': 'Онлайн',
                             'employeeUids': [UUID("271bba62-5521-daa7-aaf7-002948575567"),
                                              UUID("278bba62-5521-daa7-fff7-002948575567")],
                             'price': 7000,
                             'descriptions': 'Навчання відбувається з використанням навчальної платформи (в неї можна заходити з телефону, планшету чи комп’ютеру) та програми Zoom;\n- заняття проходять в групі онлайн згідно за розкладом по суботах та неділях по 3-4 години на день (в залежності від навчальної теми);\n- всі лекції записуються та відгружаються на навчальну платформу. Їх можна передивлятись в любий час за потребою;\n- додатково на платформі є лекції у запису з теоретичного матеріалу для самостійного вивчення;\n- студентам надаються методичні матеріали та професійна література;\n- у групи є куратор, який допомагає студентам в організаційних моментах навчання;\n- після проходження кожної теми, для закріплення матеріалу, треба виконувати домашні завдання і відправляти їх на перевірку. Домашні завдання з теорії – у вигляду тестів, практичні завдання треба знімати на телефон і відправляти у вигляді коротких відео',
                             'exam': '<b>теорія:</b>\nтест. Питання з анатомії, фізіології, теорії тренувального процесу;\n<b>практика:</b>\nскласти та провести демо версію тренування (аеробна частина, силовий блок та стретчинг).\nВідзняти відео і відправити на перевірку.',
                             'location': 'Zoom',
                             'crmId': 'id_7',
                             'order': 3
                             }
                    })

    # Інструктор тренажерного залу EQF-3
    courses.append({'uid': UUID("224abb13-8271-abf1-ada2-002934865559"),
                    'data': {'productUid': UUID("122abb13-8271-abf1-ada2-002934865559"),
                             'name': 'Київ',
                             'employeeUids': [UUID("271bba62-5521-daa7-aaf7-002948575567"),
                                              UUID("271bba62-5521-aaf7-daa7-002948596355")],
                             'price': 8800,
                             'descriptions': '- заняття проходять по суботах та неділях по 4-5 годин на день в залежності від теми;\n- теоретичний матеріал вивчається в онлайн форматі. навчання відбувається з використанням навчальної платформи (в неї можна заходити з телефону, планшету чи комп’ютеру) та програми Zoom. Це лекції з анатомії та фізіології (4 шт);\n- заняття проходять в групі онлайн згідно за розкладом. Всі лекції записуються та відгружаються на навчальну платформу. Їх можна передивлятись в любий час за потребою;\n- додатково на платформі є лекції у запису з теоретичного матеріалу для самостійного вивчення;\n- студентам надаються методичні матеріали та професійна література;\n- у групи є куратор, який допомагає студентам в організаційних моментах навчання;\n- після проходження кожної теми, для закріплення матеріалу, треба виконувати домашні завдання (у вигляді тестів) і відправляти їх на перевірку;\n- після вивчення теорії починається практика;\n- практичні заняття відбуваються офлайн у фітнес клубі',
                             'exam': '<b>теорія:</b>\nтест. Питання з анатомії, фізіології, теорії тренувального процесу;\n<b>практика:</b>\nпровести розминку, демонстрація трьох вправ на тренажері, з вільними вагами та з власною вагою - знання м’язів, які працюють під час виконання вправ, правильність дихання та типові помилки.',
                             'location': 'Клуб Apollo Next. Київ, ТРЦ ХарьОК, вул. Братства тарасівців, 9Е',
                             'crmId': 'id_2',
                             'order': 1
                             }
                    })

    courses.append({'uid': UUID("225abb13-8271-abf1-ada2-002934865559"),
                    'data': {'productUid': UUID("122abb13-8271-abf1-ada2-002934865559"),
                             'name': 'Харків',
                             'employeeUids': [UUID("271bba62-5521-daa7-aaf7-002948575567"),
                                              ],
                             'price': 7900,
                             'descriptions': '- заняття проходять по суботах та неділях по 4-5 годин на день в залежності від теми;\n- теоретичний матеріал вивчається в онлайн форматі. навчання відбувається з використанням навчальної платформи (в неї можна заходити з телефону, планшету чи комп’ютеру) та програми Zoom. Це лекції з анатомії та фізіології (4 шт);\n- заняття проходять в групі онлайн згідно за розкладом. Всі лекції записуються та відгружаються на навчальну платформу. Їх можна передивлятись в любий час за потребою;\n- додатково на платформі є лекції у запису з теоретичного матеріалу для самостійного вивчення;\n- студентам надаються методичні матеріали та професійна література;\n- у групи є куратор, який допомагає студентам в організаційних моментах навчання;\n- після проходження кожної теми, для закріплення матеріалу, треба виконувати домашні завдання (у вигляді тестів) і відправляти їх на перевірку;\n- після вивчення теорії починається практика;\n- практичні заняття відбуваються офлайн у фітнес клубі',
                             'exam': '<b>теорія:</b>\nтест. Питання з анатомії, фізіології, теорії тренувального процесу;\n<b>практика:</b>\nпровести розминку, демонстрація трьох вправ на тренажері, з вільними вагами та з власною вагою - знання м’язів, які працюють під час виконання вправ, правильність дихання та типові помилки.',
                             'location': 'Клуб Puls Gym. Харків, пр. Тракторобудівників, 107 В',
                             'crmId': 'id_3',
                             'order': 2
                             }
                    })

    courses.append({'uid': UUID("226abb13-8271-abf1-ada2-002934865559"),
                    'data': {'productUid': UUID("122abb13-8271-abf1-ada2-002934865559"),
                             'name': 'Івано-Франківськ',
                             'employeeUids': [UUID("931bab62-5521-baf7-daa7-002948596355"),
                                              ],
                             'price': 9000,
                             'descriptions': '- заняття проходять по суботах та неділях по 4-5 годин на день в залежності від теми;\n- теоретичний матеріал вивчається в онлайн форматі. навчання відбувається з використанням навчальної платформи (в неї можна заходити з телефону, планшету чи комп’ютеру) та програми Zoom. Це лекції з анатомії та фізіології (4 шт);\n- заняття проходять в групі онлайн згідно за розкладом. Всі лекції записуються та відгружаються на навчальну платформу. Їх можна передивлятись в любий час за потребою;\n- додатково на платформі є лекції у запису з теоретичного матеріалу для самостійного вивчення;\n- студентам надаються методичні матеріали та професійна література;\n- у групи є куратор, який допомагає студентам в організаційних моментах навчання;\n- після проходження кожної теми, для закріплення матеріалу, треба виконувати домашні завдання (у вигляді тестів) і відправляти їх на перевірку;\n- після вивчення теорії починається практика;\n- практичні заняття відбуваються офлайн у фітнес клубі',
                             'exam': '<b>теорія:</b>\nтест. Питання з анатомії, фізіології, теорії тренувального процесу;\n<b>практика:</b>\nпровести розминку, демонстрація трьох вправ на тренажері, з вільними вагами та з власною вагою - знання м’язів, які працюють під час виконання вправ, правильність дихання та типові помилки.',
                             'location': 'Клуб Animal Gym. Івано-Франківськ, вул. Коновальця, 7Б, Панорама Plaza, 5 поверх',
                             'crmId': 'id_5',
                             'order': 3
                             }
                    })

    courses.append({'uid': UUID("227abb13-8271-abf1-ada2-002934865559"),
                    'data': {'productUid': UUID("122abb13-8271-abf1-ada2-002934865559"),
                             'name': 'Черкаси',
                             'employeeUids': [UUID("931bab62-5521-baf1-daa7-002948635955"),
                                              ],
                             'price': 8000,
                             'descriptions': '- заняття проходять по суботах та неділях по 4-5 годин на день в залежності від теми;\n- теоретичний матеріал вивчається в онлайн форматі. навчання відбувається з використанням навчальної платформи (в неї можна заходити з телефону, планшету чи комп’ютеру) та програми Zoom. Це лекції з анатомії та фізіології (4 шт);\n- заняття проходять в групі онлайн згідно за розкладом. Всі лекції записуються та відгружаються на навчальну платформу. Їх можна передивлятись в любий час за потребою;\n- додатково на платформі є лекції у запису з теоретичного матеріалу для самостійного вивчення;\n- студентам надаються методичні матеріали та професійна література;\n- у групи є куратор, який допомагає студентам в організаційних моментах навчання;\n- після проходження кожної теми, для закріплення матеріалу, треба виконувати домашні завдання (у вигляді тестів) і відправляти їх на перевірку;\n- після вивчення теорії починається практика;\n- практичні заняття відбуваються офлайн у фітнес клубі',
                             'exam': '<b>теорія:</b>\nтест. Питання з анатомії, фізіології, теорії тренувального процесу;\n<b>практика:</b>\nпровести розминку, демонстрація трьох вправ на тренажері, з вільними вагами та з власною вагою - знання м’язів, які працюють під час виконання вправ, правильність дихання та типові помилки.',
                             'location': '<b>теорія:</b>\nфітнес студія FitsMe. Черкаси, бульв. Шевченка, 150;\n<b>практика:</b>\nклуб Sport Life Південний. Черкаси, вул. Ярославська, 7/1',
                             'crmId': 'id_4',
                             'order': 4
                             }
                    })

    courses.append({'uid': UUID("228abb13-8271-abf1-ada2-002934865559"),
                    'data': {'productUid': UUID("122abb13-8271-abf1-ada2-002934865559"),
                             'name': 'Львів',
                             'employeeUids': [UUID("931bab62-5721-baf3-daa9-002948635955"),
                                              ],
                             'price': 9000,
                             'descriptions': '- заняття проходять по суботах та неділях по 4-5 годин на день в залежності від теми;\n- теоретичний матеріал вивчається в онлайн форматі. навчання відбувається з використанням навчальної платформи (в неї можна заходити з телефону, планшету чи комп’ютеру) та програми Zoom. Це лекції з анатомії та фізіології (4 шт);\n- заняття проходять в групі онлайн згідно за розкладом. Всі лекції записуються та відгружаються на навчальну платформу. Їх можна передивлятись в любий час за потребою;\n- додатково на платформі є лекції у запису з теоретичного матеріалу для самостійного вивчення;\n- студентам надаються методичні матеріали та професійна література;\n- у групи є куратор, який допомагає студентам в організаційних моментах навчання;\n- після проходження кожної теми, для закріплення матеріалу, треба виконувати домашні завдання (у вигляді тестів) і відправляти їх на перевірку;\n- після вивчення теорії починається практика;\n- практичні заняття відбуваються офлайн у фітнес клубі',
                             'exam': '<b>теорія:</b>\nтест. Питання з анатомії, фізіології, теорії тренувального процесу;\n<b>практика:</b>\nпровести розминку, демонстрація трьох вправ на тренажері, з вільними вагами та з власною вагою - знання м’язів, які працюють під час виконання вправ, правильність дихання та типові помилки.',
                             'location': 'Клуб LEGENDA Sport. Львів, вул. Шевченка, 111а',
                             'crmId': 'id_6',
                             'order': 5
                             }
                    })

    courses.append({'uid': UUID("229abb13-8271-abf1-ada2-002934865559"),
                    'data': {'productUid': UUID("122abb13-8271-abf1-ada2-002934865559"),
                             'name': 'Онлайн',
                             'employeeUids': [UUID("271bba62-5521-daa7-aaf7-002948575567"),
                                              ],
                             'price': 7000,
                             'descriptions': '- заняття проходять по суботах та неділях по 4-5 годин на день в залежності від теми;\n- теоретичний матеріал вивчається в онлайн форматі. навчання відбувається з використанням навчальної платформи (в неї можна заходити з телефону, планшету чи комп’ютеру) та програми Zoom. Це лекції з анатомії та фізіології (4 шт);\n- заняття проходять в групі онлайн згідно за розкладом. Всі лекції записуються та відгружаються на навчальну платформу. Їх можна передивлятись в любий час за потребою;\n- додатково на платформі є лекції у запису з теоретичного матеріалу для самостійного вивчення;\n- студентам надаються методичні матеріали та професійна література;\n- у групи є куратор, який допомагає студентам в організаційних моментах навчання;\n- після проходження кожної теми, для закріплення матеріалу, треба виконувати домашні завдання (у вигляді тестів) і відправляти їх на перевірку;\n- після вивчення теорії починається практика;\n- практичні заняття відбуваються офлайн у фітнес клубі',
                             'exam': '<b>теорія:</b>\nтест. Питання з анатомії, фізіології, теорії тренувального процесу;\n<b>практика:</b>\nпровести розминку, демонстрація трьох вправ на тренажері, з вільними вагами та з власною вагою - знання м’язів, які працюють під час виконання вправ, правильність дихання та типові помилки.',
                             'location': 'Zoom',
                             'crmId': 'id_1',
                             'order': 6
                             }
                    })

    # Персональний тренер EQF-4
    courses.append({'uid': UUID("230abb13-8271-abf1-ada2-002934865559"),
                    'data': {'productUid': UUID("123abb13-8271-abf1-ada2-002934865559"),
                             'name': 'Івано-Франківськ',
                             'employeeUids': [UUID("931bab62-5521-baf7-daa7-002948596355"),
                                              ],
                             'price': 10000,
                             'descriptions': '- заняття проходять по суботах та неділях по 4-5 годин на день в залежності від теми;\n- заняття проходять в групі згідно за розкладом;\n- студентам надаються методичні матеріали та професійна література',
                             'exam': '<b>теорія:</b>\nтест. Питання з анатомії, фізіології, теорії тренувального процесу;\n<b>практика:</b>\nпровести розминку, демонстрація трьох вправ на тренажері, з вільними вагами та з власною вагою - знання м’язів, які працюють під час виконання вправ, правильність дихання та типові помилки',
                             'location': 'Клуб Animal Gym. Івано-Франківськ, вул. Коновальця, 7Б, Панорама Plaza, 5 поверх',
                             'crmId': 'id_13',
                             'order': 1
                             }
                    })

    courses.append({'uid': UUID("231abb13-8271-abf1-ada2-002934865559"),
                    'data': {'productUid': UUID("123abb13-8271-abf1-ada2-002934865559"),
                             'name': 'Онлайн',
                             'employeeUids': [UUID("931bab62-5521-baf7-daa7-002948596355"),
                                              ],
                             'price': 9000,
                             'descriptions': '- заняття проходять по суботах та неділях по 4-5 годин на день в залежності від теми;\n- заняття проходять в групі згідно за розкладом;\n- студентам надаються методичні матеріали та професійна література',
                             'exam': '<b>теорія:</b>\nтест. Питання з анатомії, фізіології, теорії тренувального процесу;\n<b>практика:</b>\nпровести розминку, демонстрація трьох вправ на тренажері, з вільними вагами та з власною вагою - знання м’язів, які працюють під час виконання вправ, правильність дихання та типові помилки',
                             'location': 'Zoom',
                             'crmId': 'id_12',
                             'order': 2
                             }
                    })

    # Дієтолог-нутріціолог
    courses.append({'uid': UUID("232abb13-8271-abf1-ada2-002934865559"),
                    'data': {'productUid': UUID("124abb13-8271-abf1-ada2-002934865559"),
                             'name': 'Онлайн',
                             'employeeUids': [UUID("931bab72-8721-baf8-daa9-002948635559"),
                                              ],
                             'price': 3500,
                             'descriptions': '- навчання відбувається з використанням навчальної платформи (в неї можна заходити з телефону, планшету чи комп’ютеру) та програми Zoom\n -заняття проходять в групі онлайн згідно за розкладом по суботах та неділях по 3,5 години на день (в залежності від навчальної теми)\n -всі лекції записуються та відгружаються на навчальну платформу. Їх можна передивлятись в любий час за потребою\n- студентам надаються методичні матеріали\n- у групи є куратор, який допомагає студентам в організаційних моментах навчання\n- тривалість - 4 навчальні дні',
                             'exam': '<b>теорія:</b>\nтест. Питання по вивченому матеріалу',
                             'location': 'Zoom',
                             'crmId': 'id_11',
                             'order': 1
                             }
                    })

    await add_objects(session, Course, courses)

    coursesSchedule = list()
    # Інструктор групових програм EQF-3
    coursesSchedule.append(
        {'courseUid': UUID("221abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=3, day=2)})
    coursesSchedule.append(
        {'courseUid': UUID("221abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=5, day=11)})

    coursesSchedule.append(
        {'courseUid': UUID("222abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=3, day=2)})
    coursesSchedule.append(
        {'courseUid': UUID("222abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=5, day=11)})

    coursesSchedule.append(
        {'courseUid': UUID("223abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=3, day=2)})
    coursesSchedule.append(
        {'courseUid': UUID("223abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=5, day=11)})

    # Інструктор тренажерного залу EQF-3
    coursesSchedule.append(
        {'courseUid': UUID("224abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=3, day=2)})
    coursesSchedule.append(
        {'courseUid': UUID("224abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=5, day=11)})

    coursesSchedule.append(
        {'courseUid': UUID("225abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=3, day=2)})
    coursesSchedule.append(
        {'courseUid': UUID("225abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=5, day=11)})


    coursesSchedule.append(
        {'courseUid': UUID("227abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=3, day=2)})
    coursesSchedule.append(
        {'courseUid': UUID("227abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=5, day=11)})

    coursesSchedule.append(
        {'courseUid': UUID("228abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=3, day=2)})
    coursesSchedule.append(
        {'courseUid': UUID("228abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=4, day=6)})

    coursesSchedule.append(
        {'courseUid': UUID("229abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=3, day=2)})
    coursesSchedule.append(
        {'courseUid': UUID("229abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=5, day=11)})

    # Персональний тренер EQF-4
    coursesSchedule.append(
        {'courseUid': UUID("230abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=4, day=27)})

    coursesSchedule.append(
        {'courseUid': UUID("231abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=3, day=9)})

    # Дієтолог-нутріціолог
    coursesSchedule.append(
        {'courseUid': UUID("232abb13-8271-abf1-ada2-002934865559"), 'startDate': datetime(year=2024, month=3, day=30)})

    await add_objects(session, CourseSchedule, coursesSchedule)
