from sqlalchemy.ext.asyncio import create_async_engine, async_sessionmaker

from bot import models
from bot.config import settings


async def add_products(Session, products: list):
    async with Session() as db:
        for product in products:
            db.add(models.Product(data=product))

        await db.commit()


async def run():
    engine = create_async_engine(settings.DATABASE_URI, pool_size=20, max_overflow=20, future=True)

    session = async_sessionmaker(engine, expire_on_commit=False)

    products = list()
    products.append({'name': 'Інструктор групових програм EQF-3',
                     'descriptions': 'Це базовий курс з підготовки фахівців фітнес індустрії, після якого випускники можуть працювати в любому спортивному або фітнес клубі, як тренер групових занять. Вивчається: базова, танцювальна та степ аеробіка; силовий та функціональний тренінг; стретчинг. Після навчання випускники зможуть самостійно побудувати та провести любий груповий клас за цими напрямками. Тривалість навчання півтора місяці.',
                     'content': '<b><u>Теоретичний блок:</u></b>\nАнатомія, фізіологія, біомеханіка руху;\nТеорія тренувального процесу;\nАдаптація до фізичного навантаження та методи зміни її інтенсивності;\nАеробіка та силові класи;\nОснови харчування;\n\n<b><u>Практичний блок:</u></b>\nСтруктура групового тренування та складання тренувальних програм;\nВивчення принципів ритміки та роботи під музику;\nБазові кроки та їх модифікації;\nЗміни ніг, складання та розкладки зв’язок;\nТренерські навички роботи із групою;\nНавички розподілу навантажень, контроль за технікою безпекою та здоров’ям клієнтів;\nФункціональний тренінг;',
                     'certificate': 'По завершенню навчання випускники отримують міжнародний сертифікат із присвоєнням кваліфікації «Group Fitness Instructor – EQF Level 3» та зараховуються до Єдиного Українського Тренерського Реєстру REPS Ukraine. Пластиковий сертифікат відправляємо Новою Поштою по Україні (для онлайн курсів)'})

    products.append({'name': 'Інструктор тренажерного залу EQF-3',
                     'descriptions': 'Це базовий курс з підготовки фахівців фітнес індустрії, після якого випускники можуть працювати в любому спортивному або фітнес клубі, як тренер тренажерної зали. Вивчається: робота з тренажерами, з вільними вагами та з власним тілом; техніка виконання вправ, дихання та координації рухів.\nПісля навчання випускники зможуть самостійно скласти тренувальну програму для будь якого клієнта та провести тренування. Тривалість навчання півтора місяці',
                     'content': '<b><u>Теоретичний блок:</u></b>\nАнатомія, фізіологія, біомеханіка руху;\nПринципи тренувального процесу;\nФізіологічні процеси, що відбуваються в організмі під час тренування;\nАдаптація та безпека фізичного навантаження;\nМетоди зміни інтенсивності навантажень;\nМодифікації вправ;\nАеробне/анаеробне навантаження;\nМетодики моніторингу інтенсивності вправ;\nМетодика побудування тренувального процесу, враховуючи тип клієнта та його цілі;\nОснови харчування.\n\n<b><u>Практичний блок:</u></b>\nЗнайомство з видами тренажерів, коректною роботою з ними та вільними вагами на практиці;\nВиди вправ різні групи м’язів, їх модифікації із застосуванням різного обладнання, техніка виконання;\nПланування та організація тренувального процесу;\nСкладання тренувальних програм залежно від стану здоров’я, статі, віку, цілей та завдань клієнта;\nВиди тренувань, цикли;',
                     'certificate': 'По завершенню навчання випускники отримують міжнародний сертифікат із присвоєнням кваліфікації «Gym Instructor – EQF Level 3» та зараховуються до Єдиного Українського Тренерського Реєстру REPS Ukraine. Пластиковий сертифікат відправляємо Новою Поштою по Україні (для онлайн курсів)'})

    products.append({'name': 'Персональний тренер EQF-4',
                     'descriptions': 'Це найвищій рівень з підготовки фахівців фітнес індустрії. До курсу допускаються тренери, які вже мають базову освіту за кваліфікацією «інструктор тренажерної зали». Під час навчання тренери отримають поглиблені знання з функціональної анатомії та кінезіології, біомеханіки руху, тестування фізичного стану клієнта, модифікації базових вправ під задачі кожного клієнта, методики тренування професійних спортсменів. Тривалість навчання півтора місяці.',
                     'content': '<b><u>Теоретичний блок:</u></b>\nФункціональна анатомія та біомеханіка руху;\nПринципи тренувального процесу;\nФізіологія, кінезіологія;\nАдаптація до фізичного навантаження, моніторинг його інтенсивності;\nМетоди зміни інтенсивності навантажень;\nМодифікації вправ;\nРозвиток сили, швидкості, витривалості, гнучкості та координації;\nМетодика побудування тренувального процесу, враховуючи тип клієнта та його цілі.\n\n<b><u>Практичний блок:</u></b>\nОцінка фізичного стану клієнта;\nСоматотипи;\nТехніка виконання вправ та їх модифікація;\nТренувальні адаптації;\nРозробка та планування тренувальних програм;\nПереодизація навантажень;\nРобота з професійними спортсменами;',
                     'certificate': 'По завершенню навчання випускники отримують міжнародний сертифікат із присвоєнням кваліфікації «Personal Trainer – EQF Level 4» та зараховуються до Єдиного Українського Тренерського Реєстру REPS Ukraine. Пластиковий сертифікат відправляємо Новою Поштою по Україні (для онлайн курсів)'})

    products.append({'name': 'Дієтолог-нутріціолог',
                     'descriptions': 'Авторський курс від лікаря загальної практики, дипломованого дієтолога – нутріціолога. Це повний базовий курс навчання, призначений для людей з різним рівнем досвіду та знань у цій галузі.Складається з 8 блоків лекцій та практичної цінної інформації, у яких максимально повно розкривається тема дієтології та даються глибокі знання. По закінченню навчання випускники отримують сертифікати, що підтверджують їх рівень освіти та кваліфікацію та можуть працювати дієтологами-нутриціологами у будь-якому спортивно-оздоровчому центрі або здійснювати персональну практику.',
                     'content': '<b><u>Блок 1.</u></b> Травнева система. Мікрофлора\n– травнева система, будова та функції;\n– ферменти та їх функції;\n– печінка: будова та функції;\n– тонкий та товстий кишечник: будова та функції;\n– цикл травлення; – мікрофлора.\n<b><u>Блок 2.</u></b> Обмін речовин. БЖВ: їх види та джерела\n– БЖВ: функції та види;\n– водний баланс.\n<b><u>Блок 3.</u></b> Мікронутрієнти. Вітаміни. Баластові речовини\n– джерела;\n– добові норми;\n– функції;\n<b><u>Блок 4.</u></b> Гормони, що впливають наголод, травлення та обмін речовин\n– інсулін;\n– кортизол;\n– грелін;\n– тестостерон;\n– естроген;\n– прогестерон;\n– тироксін;\n– трийодтіронін;\n– лептін;\n– мелатонін;\n– глюкокортикоїди.\n<b><u>Блок 5.</u></b> Голод та його види. Інтервальне голодування\n– кількісне/якісне голодування, причини голоду;\n– булімія та анорексія;\n– хвороби, що впливають на засвоєння нутрієнтів.\n<b><u>Блок 6.</u></b> Психологія харчової поведінки. Стрес. Мотивація.\n<b><u>Блок 7.</u></b> Розрахунок БЖВ\n– практична робота.\n<b><u>Блок 8.</u></b> Внутрішній іспит для підтвердження знань та сертифікація.',
                     'certificate': 'Пластиковий сертифікат відправляємо Новою Поштою по Україні.'})

    await add_products(session, products)
